---
type: WireSetIterator
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 4
tags: [revit-api, class]
---

# WireSetIterator

`Autodesk.Revit.DB.Electrical.WireSetIterator` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | WireSetIterator | — | `public WireSetIterator ()` |
| Method | MoveNext | — | `public virtual bool MoveNext ()` |
| Method | Reset | — | `public virtual void Reset ()` |
| Property | Current | — | `public virtual Object Current { get ; }` |